var i = 0;
var txt = `با سلام از آنجا که پاسخگویی صحیح دقیق و سریع از ویژگی های یک اپراتور مسلط است لذا لازم است همکاران گرامی به چند نکته توجه کنند.
هنگام پاسخگویی صفحه سیستم شامل ۴ بخش اصلی میباشد.
عنوان شغلی
گروه شغلی
زیر گروه شغلی 
آدرس 
مفهوم اسلش: 
بن./ یعنی جستجو در گروه شغلی بنیاد
بن.شهید/ یعنی جستجو در گروه شغلی بنیاد و زیرگروه شغلی شهید به طور همزمان
.شهید/ یعنی جستجو فقط در زیر گروه شغلی شهید
اگر بعد از ./ عنوان شغلی مورد نظر را تایپ کنیم فقط جستجو در عناوین شغلی میباشد. و با اسلش بعدی جستجو در آدرس را خواهیم داشت.
همکاران محترم با توجه به درخواست مشترک باید تشخیص صحیح بدهند که در کدام بخش به جستجو بپردازند. 
مفهوم خط فاصله یا آندرلاین: 
آندرلاین این قابلیت را دارد که هنگام جستجو در عناوین شغلی اگر بین کلمات آندرلاین بگذاریم حتی اگر چینش کلمات درست نباشد سیستم قابلیت پاسخگویی خواهد داشت به طور مثال کانون زبان ایران
اگر تایپ کنیم ./ایران-کانون-زبان سیستم کانون زبان ایران را جستجو میکند. که در یافتن مطب پزشکان تخصصص آن ها کاربرد دارد
کاربرد فاصله یا اسپیس:
اگر املای صحیح یک کلمه را نمیدانید حرفی را که نمیدانید به چه صورت نوشته میشود را با فاصله پر میکنیم سیستم قابلیت اصلاح دارد که این در پیدا کردن نام و نام خانوادگی افراد بسیار کاربردی است.
یک مثال کاربردی: 
درخواست مشترک وانت تلفنی در خیابان خاقانی
شما تایپ کنید: .وانت//خاقانی
دو اسلش کنار هم یعنی ما عنوان شغلی را نداشتیم. و با گذاشتن اسلش به مرحله بعد رفتیم.`;
var speed = 100; /* The speed/duration of the effect in milliseconds */
var scroll = true;

function typeWriter() {
  if (i < txt.length) {
    if (text[i] == "<br/>") {
      document.getElementById("text").insertAdjacentHTML("beforeend", "<br/>");
    } else {
      document.getElementById("text").innerHTML += txt[i];
    }
    i++;
    setTimeout(typeWriter, speed)
  } else {
    scroll = false;
  }
}

typeWriter();

function pageScroll() {
  console.log(scroll);
  if (scroll == true) {
    window.scrollTo(0,document.body.scrollHeight);
  } else {
    return;
  }
  scrolldelay = setTimeout(pageScroll,10);
}

pageScroll();